export const objectCatalog=[
 ['table','长桌','家具',[1.4,.75,.8],'#aa8662'],['round-table','圆桌','家具',[1,.74,1],'#b7926e'],
 ['chair','椅子','家具',[.48,.88,.48],'#7d9180'],['stool','圆凳','家具',[.38,.45,.38],'#b18e67'],['bench','长凳','家具',[1.3,.45,.38],'#9c7958'],
 ['box','箱子','物品',[.55,.55,.55],'#b99b71'],['sphere','球体','物品',[.45,.45,.45],'#b4c1b5'],['cylinder','圆柱','物品',[.4,.7,.4],'#bac0bb'],['cup','杯子','物品',[.12,.14,.1],'#ede5d4'],['book','书本','物品',[.22,.04,.3],'#688782'],
 ['platform','地台','建筑',[3,.2,2],'#bcb9ab'],['wall','墙体','建筑',[3,2.8,.16],'#d5ccb9'],['doorway','门洞','建筑',[2.4,2.8,.2],'#c9bca5'],['window-wall','窗墙','建筑',[3,2.8,.2],'#d5ccb9'],['stairs','楼梯','建筑',[1.4,1.2,2],'#b6b9b0'],['house','房屋块','建筑',[3,3.2,2.6],'#c6b89e'],
 ['glass-wall','观景玻璃墙','环境',[8,4.2,.12],'#b5e3ec'],['aquarium-tank','观景水槽','环境',[8,4.2,5],'#57c8f2'],['fish','鱼','环境',[.64,.3,.13],'#9ccbd6']
].map(([id,name,category,size,color])=>({id,name,category,size,color}));
export const objectSpec=type=>objectCatalog.find(x=>x.id===type);
